In [1]:
#qn 1
 
import pandas as pd 
print(pd.__version__)

1.1.4

In [2]:
#qn 2

import pandas as pd 
import numpy as np 
ar = np.array(['a', 'b', 'c', 'd', 'e']) 
s = pd.Series(ar) 
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [7]:
#qn 3

import pandas as pd 
df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 
                   'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 
                   'Marks(%)': [97, 90, 70, 82], 
                   'Grade': ['A', 'A', 'C', 'B'], 
                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 
df

  Roll Number     Name  Marks(%) Grade  Subject
0     20CSE29   Amelia        97     A  Physics
1     20CSE49      Sam        90     A  Physics
2     20CSE36     Dean        70     C  Physics
3     20CSE44  Jessica        82     B  Physics

In [12]:
#qn 4

import seaborn as sb
sb.get_dataset_names()
df = sb.load_dataset('mpg')
df.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [17]:
#qn 5
df['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [22]:
#qn 6

dl = df.groupby('origin')
uscr = dl.get_group('usa')
uscr

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]